Revit 2017 API
DatumPlane.GetDatumExtentTypeInView Method
 Identifies if the end of the datum plane is aligned with 3D extents or is set to vary specifically in the indicated view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2016
Syntax
C#
public DatumExtentType GetDatumExtentTypeInView(
	DatumEnds datumEnd,
	View view
)
Visual Basic
Public Function GetDatumExtentTypeInView ( _
	datumEnd As DatumEnds, _
	view As View _
) As DatumExtentType
Visual C++
public:
DatumExtentType GetDatumExtentTypeInView(
	DatumEnds datumEnd,
	View^ view
)
Parameters
datumEnd
Type: Autodesk.Revit.DB.DatumEnds
 The end of the datum plane.
view
Type: Autodesk.Revit.DB.View
 The view in which to evaluate the datum extent settings.
Return Value
 The extent type.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The datum plane cannot be visible in the view.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
DatumPlane Class
Autodesk.Revit.DB Namespace